HalloYang06/PSOC_E84_robot/firmware/m55/applications/ifx_deepcraft/source/ifx_pre_post_process.c
/******************************************************************************
* File Name: ifx_pre_post_process.c
*
* Description: This file contains functions to initialize and run frame by frame
*              Infineon pre and post process functions.
*
*
*******************************************************************************
* (c) 2021, Infineon Technologies Company. All rights reserved.
*******************************************************************************
* This software, including source code, documentation and related materials
* ("Software"), is owned by Infineon Technologies Company (Infineon) or one of its
* subsidiaries and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software ("EULA").
*
* If no EULA applies, Infineon hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Infineon's integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Infineon.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Infineon
* reserves the right to make changes to the Software without notice. Infineon
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Infineon does
* not authorize its products for use in any products where a malfunction or
* failure of the Infineon product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Infineon's product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Infineon against all liability.
*******************************************************************************/


/*******************************************************************************
* Include header file
******************************************************************************/
#include <ctype.h>
#include "stdlib.h"
#include "string.h"
#include "stdio.h"
#include "ifx_sp_utils_priv.h"
#include "ifx_sp_utils.h"
#include "ifx_sp_common_priv.h"
#include "ifx_pre_post_process.h"
#ifdef ENABLE_IFX_VA_WWD
#include "ifx_va_prms.h"
#endif
#ifdef PROFILER
#include "ifx_cycle_profiler.h"
#endif

/* Number of parameters is MAX_WW_TOKENS * 3 (i.e. prob thrshold, count threshold, & gap threshold) + 5 (Nww_series, ww_tokens, total_time, 2 garbage count thresholds) */
#define LPWWD_PP_PARMS_SIZE 17 /* Number of parameters for LPWWD post process */
/******************************************************************************
* Global variables
*****************************************************************************/

/* IP component common fisrt five configuration parameters:
 * configurator version,
 * sampling_rate,
 * frame_size,
 * IP_compnent_id,
 * number of parameters.
 */
int32_t ifx_pre_post_process_parse(int32_t* ip_prms_config, ifx_stc_pre_post_process_info_t* ip_infoPt)
{
    int32_t* int_idx = (int32_t*)ip_prms_config;
    int32_t sampling_rate, frame_size, frame_shift, num_feature, num_coeffs, ip_id, block_size, sz;
    int32_t ret;
    mem_info_t mem_info;

    //Warnings fix - Ununsed variable (results from enabling certain algos */
    (void)block_size; (void)num_coeffs; (void)num_feature; (void)frame_shift; (void)block_size; (void)ret; (void)mem_info;

    /* Sanity check of input arguments */
    if (ip_prms_config == NULL)
    {
        return IFX_SP_ENH_ERROR(IFX_SP_ENH_COMPONENT_ID_INVALID, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }
    /* read first five parameters which are always same definition */
    sz = *int_idx++;             /* Configurator version, no checking its validation for now */
    ip_infoPt->configurator_version = sz;
    ip_infoPt->libsp_version = IFX_SP_LPWWD_VERSION;
    sampling_rate = *int_idx++;  /* sampling rate */
    frame_size = *int_idx++;     /* frame size */
    ip_id = *int_idx++;          /* IP component ID */
    sz = *int_idx++;             /* number of following parameters */
    if (sz < 0)
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
    }
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF || ip_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
    {
        if (sampling_rate != 16000 && sampling_rate != 44100 && sampling_rate != 48000) {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
    }
    else if (sampling_rate != 16000)
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
    }
    /* Sanity check of input arguments */
    if (ip_infoPt == NULL)
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }

    ip_infoPt->component_id = ip_id;
    ip_infoPt->sampling_rate = sampling_rate;
    ip_infoPt->input_frame_size = frame_size;

#ifdef ENABLE_IFX_AGC
    if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_AGC)
    {
        if (frame_size <= 0 || sz != AGC_PARMS_SIZE) /* AGC parameter size */
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        ip_infoPt->output_size = frame_size;
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->frame_shift = 0;
        ip_infoPt->fft_block_size = 0;
    }
    else
#endif
#ifdef ENABLE_IFX_VA_WWD
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_DENOISE)
    {
        if (frame_size != 160 || sz != 1)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        ip_infoPt->output_size = *int_idx;  /* itsi feature output size */
        if (ip_infoPt->output_size != FEATURE_BUF_SZ)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->frame_shift = 0;    /* built in hidden parameter */
        ip_infoPt->fft_block_size = 0; /* built in hidden parameter */
    }
    else if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_DFWWD)
    {
        if (frame_size != 160 || sz != 1)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->output_size = 0;    /* itsi DFWWD output one value */
        ip_infoPt->frame_shift = 0;    /* built in hidden parameter */
        ip_infoPt->fft_block_size = 0; /* parameter not used */
    }
    else
#endif
#ifdef ENABLE_IFX_VA_CMD
    if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_DFCMD)
    {
        if (frame_size != 160 || sz != 2)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->output_size = 0;    /* itsi DFCMD output one value */
        ip_infoPt->frame_shift = 0;    /* built in hidden parameter */
        ip_infoPt->fft_block_size = 0; /* parameter not used */
    }
    else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_HPF
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
    {
        if (frame_size <= 0 || sz != 0)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        ip_infoPt->output_size = frame_size;
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->frame_shift = 0;
        ip_infoPt->fft_block_size = 0;
    }
    else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_ASRC_LPF
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF)
    {
        if (frame_size <= 0 || sz != 0)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        ip_infoPt->output_size = frame_size;
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->frame_shift = 0;
        ip_infoPt->fft_block_size = 0;
    }
    else
#endif
#if defined(ENABLE_IFX_LPWWD) || defined(ENABLE_IFX_FE)
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_MFCC || ip_id == IFX_PRE_PROCESS_IP_COMPONENT_LOG_MEL)
    {
        frame_shift = *int_idx++;    /* frame shift */
        sz--;
        if (sz < 1)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        else
        {
            num_feature = *int_idx++;    /* number of features */
            sz--;
        }
        if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_MFCC)
        {
            if (sz != 1)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
            }
            num_coeffs = *int_idx++;     /* number of DCT coeffs */
            sz = num_coeffs;
        }
        else
        {
            num_coeffs = 0;
            sz = num_feature;
        }
        if (num_feature < 0 || num_feature > MAX_FBANK_SIZE || num_coeffs > num_feature) /* num_coeffs is less than num_fbank_bins */
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        if (frame_shift > frame_size)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }

        block_size = (int32_t)pow(2, ceil((log(frame_size) / log(2)))); // Round-up to nearest power of 2.
        if ((block_size < 256) || (block_size > 1024))
        {/* Supported block_size is between 256 to 1024 */
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        ip_infoPt->fft_block_size = block_size;
        ip_infoPt->frame_shift = frame_shift;
        ip_infoPt->output_size = sz;
    }
    else
#endif
#if defined(ENABLE_IFX_LPWWD)
    if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_HMMS)
    {
#ifdef ENABLE_IFX_LPWWD_HMMS
        if (sz != 4)
        {/* Only four parameters */
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->frame_shift = 0;
        ip_infoPt->output_size = 0;
        ip_infoPt->fft_block_size = 0;
#else
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_INVALID_COMPONENT_ID); /* Please define ENABLE_IFX_LPWWD_HMMS */
#endif
    }
    else if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_LPWWD)
    {
        if (sz != LPWWD_PP_PARMS_SIZE)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        uint8_t ww_series = *int_idx++;    /* number of  WW */
        uint8_t ww_tokens = *int_idx++;     /* number of WW tokens */
        if (ww_series == 0 || ww_series > MAX_WW_SERIES ||
            ww_tokens == 0 || ww_tokens > MAX_WW_TOKENS || (ww_series * ww_tokens > MAX_WW_TOKENS))
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        uint16_t garbage_count_threshold = *int_idx++; /* garbage count threshold */
        uint16_t garbage_count_2nd_threshold = *int_idx++;   /* garbage count 2nd threshold */
        uint16_t total_timeout_threshold = *int_idx++; /* total timeout threshold */
        if (total_timeout_threshold == 0 || total_timeout_threshold > INT16_MAX ||
            garbage_count_threshold > INT8_MAX ||
            garbage_count_2nd_threshold > INT8_MAX)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        IFX_PPINPUT_DATA_TYPE_T prob_threshold[MAX_WW_TOKENS];
        for (int i = 0; i < MAX_WW_TOKENS; i++)
        {
            prob_threshold[i] = *int_idx++; /* probability threshold for each token */
            if (prob_threshold[i] < 0 || prob_threshold[i] > INT16_MAX)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
        }
        uint8_t count_threshold[MAX_WW_TOKENS];
        for (int i = 0; i < MAX_WW_TOKENS; i++)
        {
            count_threshold[i] = *int_idx++; /* count threshold for each token */
            if (count_threshold[i] > UINT8_MAX)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
        }
        uint8_t gap_threshold[MAX_WW_TOKENS];
        for (int i = 0; i < MAX_WW_TOKENS; i++)
        {
            gap_threshold[i] = *int_idx++; /* gap threshold for each token */
            if (gap_threshold[i] > UINT8_MAX)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
        }
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->frame_shift = 0;
        ip_infoPt->output_size = 1;
        ip_infoPt->fft_block_size = 0;
    }
    else
#endif
#ifdef ENABLE_IFX_SOD
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_SOD)
    {
        if (frame_size != 160 || sz != 2)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        /* fill zeros for parameter don't care or not applicable */
        ip_infoPt->frame_shift = 0;
        ip_infoPt->output_size = 0;
        ip_infoPt->fft_block_size = 0;
    }
    else
#endif
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_FEATURE_NOT_SUPPORTED);
    }

#if defined(ENABLE_IFX_SOD) || defined(ENABLE_IFX_LPWWD) || \
    defined(ENABLE_IFX_PRE_PROCESS_HPF) || defined(ENABLE_IFX_PRE_PROCESS_ASRC_LPF) || \
    defined(ENABLE_IFX_VA_WWD) || defined(ENABLE_IFX_VA_CMD) || defined(ENABLE_IFX_FE) || defined(ENABLE_IFX_AGC)
    /* Get required memory for model configuration */
    ret = speech_utils_getMem(ip_prms_config, ip_id, &mem_info);
    if (ret != IFX_SP_ENH_SUCCESS)
    {
        return ret;
    }
    else
    {
        ip_infoPt->memory.scratch_mem = mem_info.scratch_mem;
        ip_infoPt->memory.persistent_mem = mem_info.persistent_mem;
    }
    return IFX_SP_ENH_SUCCESS;
#else
    return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_FEATURE_NOT_SUPPORTED);
#endif
}

int32_t ifx_pre_post_process_init(int32_t * ip_prms_config, void **ifx_container, ifx_stc_pre_post_process_info_t* ip_infoPt)
{
    int32_t* int_idx = (int32_t*)ip_prms_config;
    int32_t sampling_rate, frame_size, frame_shift = 0, num_feature, num_coeffs, ip_id, block_size, sz;

    //Warnings fix - Ununsed variable (results from enabling certain algos */
    (void)block_size; (void)num_coeffs; (void)num_feature; (void)frame_shift; (void)frame_size; (void)sz;

    /* Sanity check of input arguments */
    if (ip_prms_config == NULL)
    {
        return IFX_SP_ENH_ERROR(IFX_SP_ENH_COMPONENT_ID_INVALID, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }

