HalloYang06/PSOC_E84_robot/firmware/m55/applications/ifx_deepcraft/source/ifx_pre_post_process.c
    /* read first five parameters which are always same definition */
    sz = *int_idx++;                /* Configurator version, ignore for now */
    sampling_rate = *int_idx++;     /* sampling rate */
    frame_size    = *int_idx++;     /* frame size */
    ip_id = *int_idx++;             /* IP component ID */
    sz = *int_idx++;                /* number of following parameters */

    /* Sanity check of input arguments */
    if (ifx_container == NULL || ip_infoPt == NULL)
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }
    if ((ip_infoPt->memory.persistent_mem_pt == NULL) || (ip_infoPt->memory.scratch_mem_pt == NULL))
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF || ip_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
    {
        if (sampling_rate != 16000 && sampling_rate != 44100 && sampling_rate != 48000) {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
    }
    else if (sampling_rate != 16000)
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
    }

#ifdef ENABLE_IFX_VA_WWD
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_DENOISE)
    {
        if (frame_size != 160 || sz != 1)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        sz = *int_idx;  /* itsi feature output size */
        if (sz != FEATURE_BUF_SZ)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        return itsi_feature_init(ifx_container, &(ip_infoPt->memory));
    }
    else if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_DFWWD)
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_API); /* Please call itsi_dfwwd_init() function */
    }
    else
#endif
#ifdef ENABLE_IFX_VA_CMD
    if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_DFCMD)
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_API); /* Please call itsi_dfcmd_init() function */
    }
    else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_HPF
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
    {/* Add HPF set up and init here */
        preprocess_hpf_top_struct * dPt = (preprocess_hpf_top_struct *)(ip_infoPt->memory.persistent_mem_pt);
        int32_t status;

        /* Set up pre-process AFE HPF data structure in persistent memory */
        sz = ALIGN_WORD(sizeof(preprocess_hpf_top_struct));
        memset(dPt, 0, sz);
        dPt->enable_flag = true; /* enable by default */
        dPt->sample_rate = sampling_rate;
        dPt->frame_size = frame_size;
        dPt->pre_proc_hpf.persistent_size = ip_infoPt->memory.persistent_mem;
        dPt->pre_proc_hpf.persistent_pad = ip_infoPt->memory.persistent_mem_pt;
        dPt->pre_proc_hpf.scratch.scratch_size = ip_infoPt->memory.scratch_mem;
        dPt->pre_proc_hpf.scratch.scratch_pad = ip_infoPt->memory.scratch_mem_pt;

        /* Initialize internal AFE HPF structure */
        dPt->pre_proc_hpf.ifx_component_pt = dPt->pre_proc_hpf.persistent_pad + sz;
        status = ifx_afe_hpf_init(dPt);
        *ifx_container = dPt;
        if (status != IFX_SP_ENH_SUCCESS)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        else
        {
            return IFX_SP_ENH_SUCCESS;
        }
    }
    else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_ASRC_LPF
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF)
    {/* Add HPF set up and init here */
        preprocess_asrc_lpf_top_struct* dPt = (preprocess_asrc_lpf_top_struct*)(ip_infoPt->memory.persistent_mem_pt);
        int32_t status;

        /* Set up pre-process AFE HPF data structure in persistent memory */
        sz = ALIGN_WORD(sizeof(preprocess_asrc_lpf_top_struct));
        memset(dPt, 0, sz);
        dPt->enable_flag = true; /* enable by default */
        dPt->sample_rate = sampling_rate;
        dPt->frame_size = frame_size;
        dPt->asrc_lpf.persistent_size = ip_infoPt->memory.persistent_mem;
        dPt->asrc_lpf.persistent_pad = ip_infoPt->memory.persistent_mem_pt;
        dPt->asrc_lpf.scratch.scratch_size = ip_infoPt->memory.scratch_mem;
        dPt->asrc_lpf.scratch.scratch_pad = ip_infoPt->memory.scratch_mem_pt;

        /* Initialize internal AFE HPF structure */
        dPt->asrc_lpf.ifx_component_pt = dPt->asrc_lpf.persistent_pad + sz;
        status = ifx_asrc_lpf_init(dPt);
        *ifx_container = dPt;
        if (status != IFX_SP_ENH_SUCCESS)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        else
        {
            return IFX_SP_ENH_SUCCESS;
        }
    }
    else
#endif
#ifdef ENABLE_IFX_LPWWD
    if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_HMMS)
    {
        int32_t ret;
#ifdef ENABLE_IFX_LPWWD_HMMS
        hmms_postprocess_top_struct* pp_ptr;
        int16_t detection_th, set_flag;

        if (sz != 4)
        {/* Only four parameters */
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        /* Set up post processing data structure in persistent memory */
        pp_ptr = (hmms_postprocess_top_struct*)(ip_infoPt->memory.persistent_mem_pt);
        memset(pp_ptr, 0, sizeof(hmms_postprocess_top_struct));

        pp_ptr->pp_component.persistent_size = ip_infoPt->memory.persistent_mem;
        pp_ptr->pp_component.persistent_pad = ip_infoPt->memory.persistent_mem_pt;
        pp_ptr->pp_component.scratch.scratch_size = ip_infoPt->memory.scratch_mem;
        pp_ptr->pp_component.scratch.scratch_pad = ip_infoPt->memory.scratch_mem_pt;

        /* Initialize internal post processing structure */
        pp_ptr->pp_component.ifx_component_pt = pp_ptr->pp_component.persistent_pad + ALIGN_WORD(sizeof(hmms_postprocess_top_struct));
        pp_ptr->fps = *int_idx++;
        pp_ptr->lookback_buffer_length = *int_idx++;
        pp_ptr->stacked_frame_delay = *int_idx++;
        pp_ptr->detection_threshold = *int_idx++;
        set_flag = (int16_t)(pp_ptr->detection_threshold & 0xFFFF); /* lower 16bit is set flag */
        detection_th = (int16_t)(pp_ptr->detection_threshold >> 16);/* upper 16bit is the detection threshold */
#if HMMS_CONFIG_MODEL //This compilation switch need to be set if target platform has no file IO support to read model data files.
        ret = fixed_init_lpwwd_post(pp_ptr->pp_component.ifx_component_pt, pp_ptr->lookback_buffer_length, pp_ptr->stacked_frame_delay, detection_th, set_flag);
#else
        extern int16_t* ppkwmodel;
        extern int16_t* ppgmodel;
        extern int16_t* ppnmodel;
        ret = fixed_init_lpwwd_post(pp_ptr->pp_component.ifx_component_pt, ppkwmodel, ppgmodel, ppnmodel, NULL, pp_ptr->lookback_buffer_length, pp_ptr->stacked_frame_delay, detection_th, set_flag);
#endif
        if (ret != 0)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
       *ifx_container = pp_ptr;
#else
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_INVALID_COMPONENT_ID); /* Please define ENABLE_IFX_LPWWD_HMMS */
#endif
        return ret;
    }
    else if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_LPWWD)
    {
        if (sz != LPWWD_PP_PARMS_SIZE)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        int32_t ret;
        uint8_t ww_series = *int_idx++;    /* number of  WW */
        uint8_t ww_tokens = *int_idx++;     /* number of WW tokens */
        if (ww_series == 0 || ww_series > MAX_WW_SERIES ||
            ww_tokens == 0 || ww_tokens > MAX_WW_TOKENS || (ww_series * ww_tokens > MAX_WW_TOKENS))
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        uint16_t garbage_count_threshold = *int_idx++; /* garbage count threshold */
        uint16_t garbage_count_2nd_threshold = *int_idx++;   /* garbage count 2nd threshold */
        uint16_t timeout_threshold = *int_idx++; /* total timeout threshold */
        if (timeout_threshold == 0 || timeout_threshold > INT16_MAX ||
            garbage_count_threshold > INT16_MAX ||
            garbage_count_2nd_threshold > INT16_MAX)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        IFX_PPINPUT_DATA_TYPE_T prob_threshold[MAX_WW_TOKENS];
        for (int i = 0; i < MAX_WW_TOKENS; i++)
        {
            prob_threshold[i] = *int_idx++; /* probability threshold for each token */
            if (prob_threshold[i] < 0 || prob_threshold[i] > INT16_MAX)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
        }
        uint8_t count_threshold[MAX_WW_TOKENS];
        for (int i = 0; i < MAX_WW_TOKENS; i++)
        {
            count_threshold[i] = *int_idx++; /* count threshold for each token */
            if (count_threshold[i] > UINT8_MAX)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
        }
        uint8_t gap_threshold[MAX_WW_TOKENS];
        for (int i = 0; i < MAX_WW_TOKENS; i++)
        {
            gap_threshold[i] = *int_idx++; /* gap threshold for each token */
            if (gap_threshold[i] > UINT8_MAX)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
        }

        ret = ifx_lpwwd_post_process_init(ifx_container, &(ip_infoPt->memory), prob_threshold, count_threshold, gap_threshold,
                    ww_series, ww_tokens, timeout_threshold, garbage_count_threshold, garbage_count_2nd_threshold);
        return ret;
    }
    else
#endif
#ifdef ENABLE_IFX_SOD
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_SOD)
    {
        int32_t ret;
        ret = speech_utils_sod_init(ip_prms_config, ifx_container, &(ip_infoPt->memory));
        return ret;
    }
    else
#endif
#ifdef ENABLE_IFX_SOD
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_SOD)
    {
        int32_t ret;
        ret = speech_utils_sod_init(ip_prms_config, ifx_container, &(ip_infoPt->memory));
        return ret;
    }
    else
#endif
#if defined(ENABLE_IFX_LPWWD) || defined(ENABLE_IFX_FE)
    if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_MFCC || ip_id == IFX_PRE_PROCESS_IP_COMPONENT_LOG_MEL)
    {
        if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_MFCC)
        {/* mfcc option */
            if (sz != 3)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
            frame_shift = *int_idx++;
            num_feature = *int_idx++;
            num_coeffs = *int_idx++;
        }
        else if (ip_id == IFX_PRE_PROCESS_IP_COMPONENT_LOG_MEL)
        {/* log-mel option */
            if (sz < 2 || sz > 3)
            {
                return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
            }
            frame_shift = *int_idx++;
            num_feature = *int_idx++;
            num_coeffs = 0; /* force set num_mfcc_coeffs to zero for log_ml case */
        }

        spectrogram_top_struct* dPt;
        if (frame_shift > frame_size)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        if (num_feature < 0 || num_feature > MAX_FBANK_SIZE || num_coeffs > num_feature) /* num_coeffs is less than num_fbank_bins */
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }

        /* Set up Spectrogram Transfomation data structure in persistent memory */
        dPt = (spectrogram_top_struct*)(ip_infoPt->memory.persistent_mem_pt);
        sz = ALIGN_WORD(sizeof(spectrogram_top_struct));
        memset(dPt, 0, sz);

        dPt->spctrg_component.persistent_size = ip_infoPt->memory.persistent_mem;
        dPt->spctrg_component.persistent_pad = ip_infoPt->memory.persistent_mem_pt;
        dPt->spctrg_component.scratch.scratch_size = ip_infoPt->memory.scratch_mem;
        dPt->spctrg_component.scratch.scratch_pad = ip_infoPt->memory.scratch_mem_pt;

        /* Initialize internal feature extraction structure */
        dPt->spctrg_component.ifx_component_pt = dPt->spctrg_component.persistent_pad + sz;
        sz += spectrogram_calculate_spctrg_component_size();

        block_size = ip_infoPt->fft_block_size;
        if ((block_size < 256) || (block_size > 1024))
        {/* Supported block_size is between 256 to 1024 */
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }

