HalloYang06/PSOC_E84_robot/firmware/m55/applications/ifx_deepcraft/source/ifx_pre_post_process.c
        dPt->mel_block_size = block_size;
        dPt->mel_sample_rate = sampling_rate;
        dPt->mel_frame_size = frame_size;
        dPt->mel_frame_shift = frame_shift;
        dPt->mel_num_fbank_bins = num_feature;
        dPt->mel_num_mfcc_coeffs = num_coeffs;

        /* Initialize internal Spectrogram Transfomation structure */
        mel_features_fix_init(dPt, sz);

        *ifx_container = dPt;

        return IFX_SP_ENH_SUCCESS;
    }
    else
#endif
#ifdef ENABLE_IFX_AGC
    if (ip_id == IFX_POST_PROCESS_IP_COMPONENT_AGC)
    {/* Add AGC set up and init here */
        postprocess_agc_top_struct* dPt = (postprocess_agc_top_struct*)(ip_infoPt->memory.persistent_mem_pt);
        int16_t agcParms[AGC_PARMS_SIZE];
        int32_t status;

        /* Set up post-process AGC data structure in persistent memory */
        sz = ALIGN_WORD(sizeof(postprocess_agc_top_struct));
        memset(dPt, 0, sz);
        dPt->enable_flag = true; /* enable by default */
        dPt->sample_rate = sampling_rate;
        dPt->frame_size = frame_size;
        dPt->ifx_agc.persistent_size = ip_infoPt->memory.persistent_mem;
        dPt->ifx_agc.persistent_pad = ip_infoPt->memory.persistent_mem_pt;
        dPt->ifx_agc.scratch.scratch_size = ip_infoPt->memory.scratch_mem;
        dPt->ifx_agc.scratch.scratch_pad = ip_infoPt->memory.scratch_mem_pt;

        /* Initialize internal AGC structure */
        dPt->ifx_agc.ifx_component_pt = dPt->ifx_agc.persistent_pad + sz;

        for (int i = 0; i < AGC_PARMS_SIZE; i++)
        {/* Copy agc configuable parameters for ifx_agc_config_prms.h */
            agcParms[i] = (int16_t)(*int_idx++);
        }
        status = ifx_agc_init(dPt, agcParms);
        *ifx_container = dPt;
        if (status != IFX_SP_ENH_SUCCESS)
        {
            return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_ERR_PARAM);
        }
        else
        {
            return IFX_SP_ENH_SUCCESS;
        }
    }
    else
#endif
    {
        return IFX_SP_ENH_ERROR(ip_id, IFX_SP_ENH_FEATURE_NOT_SUPPORTED);
    }
}

int32_t ifx_time_pre_process(IFX_SP_DATA_TYPE_T* input1, IFX_SP_DATA_TYPE_T* input2, void* preprocess_container, int32_t component_id, IFX_SP_DATA_TYPE_T* output1, IFX_SP_DATA_TYPE_T* output2)
{
    (void)component_id;
    /* Sanity check of input arguments */
    if (preprocess_container == NULL || (input1 == NULL && input2 == NULL) || (output1 == NULL && output2 == NULL))
    {
        return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }
#ifdef ENABLE_IFX_PRE_PROCESS_HPF
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
    {
        preprocess_hpf_top_struct* dPt = (preprocess_hpf_top_struct *)preprocess_container;
        if (dPt->pre_proc_hpf.reset_flag)
        {/* one time reset */
            int32_t status;
            dPt->pre_proc_hpf.reset_flag = false;
            status = ifx_afe_hpf_reset(preprocess_container);
            if (status != IFX_SP_ENH_SUCCESS)
            {
                return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_ERR_PARAM);
            }
        }
#ifdef PROFILER
        ifx_cycle_profile_start(&(dPt->pre_proc_hpf.profile));
#endif
        if (dPt->enable_flag)
        {
            ifx_afe_hpf(preprocess_container, input1, input2, output1, output2);
        }
        else
        {
            uint32_t size = (dPt->frame_size) * sizeof(IFX_SP_DATA_TYPE_T);
            if (input1 != NULL && output1 != NULL && input1 != output1)
            {
                memcpy(output1, input1, size);
            }
            if (input2 != NULL && output2 != NULL && input2 != output2)
            {
                memcpy(output2, input2, size);
            }
        }
#ifdef PROFILER
        ifx_cycle_profile_stop(&(dPt->pre_proc_hpf.profile));
#endif
        return IFX_SP_ENH_SUCCESS;
    }
    else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_ASRC_LPF
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF)
    {
        preprocess_asrc_lpf_top_struct* dPt = (preprocess_asrc_lpf_top_struct*)preprocess_container;
        if (dPt->asrc_lpf.reset_flag)
        {/* one time reset */
            int32_t status;
            dPt->asrc_lpf.reset_flag = false;
            status = ifx_asrc_lpf_reset(preprocess_container);
            if (status != IFX_SP_ENH_SUCCESS)
            {
                return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_ERR_PARAM);
            }
        }
#ifdef PROFILER
        ifx_cycle_profile_start(&(dPt->asrc_lpf.profile));
#endif
        if (dPt->enable_flag)
        {
            ifx_asrc_lpf(preprocess_container, input1, input2, output1, output2);
        }
        else
        {
            uint32_t size = (dPt->frame_size) * sizeof(IFX_SP_DATA_TYPE_T);
            if (input1 != NULL && output1 != NULL && input1 != output1)
            {
                memcpy(output1, input1, size);
            }
            if (input2 != NULL && output2 != NULL && input2 != output2)
            {
                memcpy(output2, input2, size);
            }
        }
#ifdef PROFILER
        ifx_cycle_profile_stop(&(dPt->asrc_lpf.profile));
#endif
        return IFX_SP_ENH_SUCCESS;
    }
    else
#endif
    return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_FEATURE_NOT_SUPPORTED);
}

int32_t ifx_time_post_process(IFX_SP_DATA_TYPE_T* input, void* postprocess_container, int32_t component_id, IFX_SP_DATA_TYPE_T* output)
{
    (void)component_id;
    /* Sanity check of input arguments */
    if (postprocess_container == NULL || input == NULL || output == NULL)
    {
        return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }
#ifdef ENABLE_IFX_AGC
    int32_t status;
    if (component_id == IFX_POST_PROCESS_IP_COMPONENT_AGC)
    {
        postprocess_agc_top_struct* dPt = (postprocess_agc_top_struct *)postprocess_container;
        if (dPt->ifx_agc.reset_flag)
        {/* one time reset */
            dPt->ifx_agc.reset_flag = false;
            status = ifx_agc_reset(postprocess_container);
            if (status != IFX_SP_ENH_SUCCESS)
            {
                return status;
            }
        }
#ifdef PROFILER
        ifx_cycle_profile_start(&(dPt->ifx_agc.profile));
#endif
        if (dPt->enable_flag)
        {
            status = ifx_agc(postprocess_container, input, output);
        }
        else
        {
            uint32_t size = (dPt->frame_size) * sizeof(IFX_SP_DATA_TYPE_T);
            memcpy(output, input, size);
            status = IFX_SP_ENH_SUCCESS;
        }
#ifdef PROFILER
        ifx_cycle_profile_stop(&(dPt->ifx_agc.profile));
#endif
        return status;
    }
    else
#endif
    return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_FEATURE_NOT_SUPPORTED);
}

int32_t ifx_spectrogram_transfer(IFX_SP_DATA_TYPE_T* in, void* spectrogram_container, IFX_FE_DATA_TYPE_T* fe_out, int32_t* out_q)
{
    (void)in, (void)spectrogram_container, (void)fe_out, (void)out_q;
#if defined(ENABLE_IFX_LPWWD) || defined(ENABLE_IFX_FE)
    spectrogram_top_struct* dPt;

    /* Sanity check of input arguments */
    if ((spectrogram_container == NULL) || (in == NULL))
    {
        return IFX_SP_ENH_ERROR(IFX_PRE_PROCESS_IP_COMPONENT_MFCC, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }

