HalloYang06/PSOC_E84_robot/firmware/m55/applications/ifx_deepcraft/source/ifx_pre_post_process.c
    dPt = (spectrogram_top_struct*)spectrogram_container;
    if (dPt->spctrg_component.reset_flag)
    {/* one time input sample tail (zero out) reset */
        int size = dPt->mel_block_size - dPt->mel_frame_size;
        if (size > 0)
        {
            memset(in, 0, size * sizeof(IFX_SP_DATA_TYPE_T));
        }
        dPt->spctrg_component.reset_flag = false;
    }
#ifdef PROFILER
    ifx_cycle_profile_start(&(dPt->spctrg_component.profile));
#endif
    mel_features_fix_compute(dPt, in, fe_out, out_q);
#ifdef PROFILER
    ifx_cycle_profile_stop(&(dPt->spctrg_component.profile));
#endif
#endif
    return IFX_SP_ENH_SUCCESS;
}

int32_t ifx_pre_post_process_mode_control(void* container, int32_t component_id, bool enable, bool reset)
{
    int32_t ErrIdx = IFX_SP_ENH_SUCCESS;
    (void)enable;
    /* Sanity check of input arguments */
    if ((container == NULL) || (component_id >= IFX_POST_PROCESS_IP_COMPONENT_MAX_COUNT) || (component_id < IFX_PRE_POST_IP_COMPONENT_START_ID))
    {
        return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }

    if (reset)
    {
#ifdef ENABLE_IFX_SOD
        if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_SOD)
        {
            sod_top_struct* dPt;

            dPt = (sod_top_struct*)container;
            dPt->sod_component.reset_flag = true;
        }
        else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_HPF
        if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
        {
            preprocess_hpf_top_struct* dPt;

            dPt = (preprocess_hpf_top_struct*)container;
            dPt->pre_proc_hpf.reset_flag = true;
        }
        else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_ASRC_LPF
        if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF)
        {
            preprocess_asrc_lpf_top_struct* dPt;

            dPt = (preprocess_asrc_lpf_top_struct*)container;
            dPt->asrc_lpf.reset_flag = true;
        }
        else
#endif
#if defined(ENABLE_IFX_LPWWD) || defined(ENABLE_IFX_FE)
        if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_MFCC || component_id == IFX_PRE_PROCESS_IP_COMPONENT_LOG_MEL)
        {/* set one time input sample tail (zero out) reset flag */
            spectrogram_top_struct* dPt;

            dPt = (spectrogram_top_struct*)container;
            dPt->spctrg_component.reset_flag = true;
        }
        else
#endif
#ifdef ENABLE_IFX_LPWWD
#ifdef ENABLE_IFX_LPWWD_HMMS
        if (component_id == IFX_POST_PROCESS_IP_COMPONENT_HMMS)
        {
            hmms_postprocess_top_struct* pp_ptr = (hmms_postprocess_top_struct*)container;
            pp_ptr->pp_component.reset_flag = true;
            fixed_reset_lpwwd_post(pp_ptr->pp_component.ifx_component_pt); /* this is optional since reset flag will trigger to call this */
        }
        else
#endif
        if (component_id == IFX_POST_PROCESS_IP_COMPONENT_LPWWD)
        {
            lpwwd_postprocess_top_struct* pp_ptr = (lpwwd_postprocess_top_struct*)container;
            pp_ptr->pp_component.reset_flag = true;
        }
        else
#endif
#ifdef ENABLE_IFX_AGC
        if (component_id == IFX_POST_PROCESS_IP_COMPONENT_AGC)
        {
            postprocess_agc_top_struct* dPt;

            dPt = (postprocess_agc_top_struct*)container;
            dPt->ifx_agc.reset_flag = true;
        }
        else
#endif
        {
            ErrIdx = IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_FEATURE_NOT_SUPPORTED);
        }
    }

    /* For now, enable/disable only applicable to SOD, HPF, ASRC LPF, AGC */
#ifdef ENABLE_IFX_SOD
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_SOD)
    {
        sod_top_struct* dPt;

        dPt = (sod_top_struct*)container;
        dPt->enable_flag = enable;
    }
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_HPF
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
    {
        preprocess_hpf_top_struct* dPt;

        dPt = (preprocess_hpf_top_struct*)container;
        dPt->enable_flag = enable;
    }
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_ASRC_LPF
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF)
    {
        preprocess_asrc_lpf_top_struct* dPt;

        dPt = (preprocess_asrc_lpf_top_struct*)container;
        dPt->enable_flag = enable;
    }
#endif
#ifdef ENABLE_IFX_AGC
    if (component_id == IFX_POST_PROCESS_IP_COMPONENT_AGC)
    {
        postprocess_agc_top_struct* dPt;

        dPt = (postprocess_agc_top_struct*)container;
        dPt->enable_flag = enable;
    }
#endif

    return ErrIdx;
}

int32_t ifx_pre_post_process_status(void* container, int32_t component_id)
{
    int32_t status = true;
    (void)component_id;
    if (container == NULL)
    {/* Argument is invalid so set to false */
        status = false;
    }
#ifdef ENABLE_IFX_PRE_PROCESS_HPF
    else if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_HPF)
    {
        preprocess_hpf_top_struct* dPt;

        dPt = (preprocess_hpf_top_struct*)container;
        status = dPt->enable_flag;
    }
    else
#endif
#ifdef ENABLE_IFX_PRE_PROCESS_ASRC_LPF
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF)
    {
    preprocess_asrc_lpf_top_struct* dPt;

    dPt = (preprocess_asrc_lpf_top_struct*)container;
    status = dPt->enable_flag;
    }
    else
#endif
#ifdef ENABLE_IFX_SOD
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_SOD)
    {
        sod_top_struct* dPt;

        dPt = (sod_top_struct*)container;
        status = dPt->enable_flag;
    }
    else
#endif
#if defined(ENABLE_IFX_LPWWD) || defined(ENABLE_IFX_FE)
    if (component_id == IFX_PRE_PROCESS_IP_COMPONENT_MFCC || component_id == IFX_PRE_PROCESS_IP_COMPONENT_LOG_MEL)
    {/* Feature extraction is always enabled */
        status = true;
    }
    else
#endif
#ifdef ENABLE_IFX_LPWWD
    if (component_id == IFX_POST_PROCESS_IP_COMPONENT_HMMS)
    {/* HMMS post process is always enabled */
#ifdef ENABLE_IFX_LPWWD_HMMS
        status = true;
#else
        status = false;
#endif
    }
    else if (component_id == IFX_POST_PROCESS_IP_COMPONENT_LPWWD)
    {/* LPWWD post process is always enabled */
        status = true;
    }
    else
#endif
#ifdef ENABLE_IFX_AGC
    if (component_id == IFX_POST_PROCESS_IP_COMPONENT_AGC)
    {
        postprocess_agc_top_struct* dPt;

        dPt = (postprocess_agc_top_struct*)container;
        status = dPt->enable_flag;
    }
    else
#endif
    {/* un-support componenet reture false */
        status = false;
    }

