HalloYang06/PSOC_E84_robot/firmware/m55/applications/ifx_deepcraft/source/ifx_pre_post_process.c
    return status;
}

int32_t ifx_post_process(IFX_PPINPUT_DATA_TYPE_T* in_probs, void* postprocess_container, int32_t component_id, int32_t* detection)
{
    (void)in_probs, (void)postprocess_container, (void)component_id, (void)detection;
#ifdef ENABLE_IFX_LPWWD
    /* Sanity check of input arguments */
    if ((postprocess_container == NULL) || (in_probs == NULL))
    {
        return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }

    if (component_id == IFX_POST_PROCESS_IP_COMPONENT_HMMS)
    {
#ifdef ENABLE_IFX_LPWWD_HMMS
        hmms_postprocess_top_struct* dPt;

#ifdef PROFILER
        ifx_cycle_profile_start(&(dPt->pp_component.profile));
#endif
        dPt = (hmms_postprocess_top_struct*) postprocess_container;
        if (dPt->pp_component.reset_flag)
        {/* one time reset */
            fixed_reset_lpwwd_post(dPt->pp_component.ifx_component_pt);
            dPt->pp_component.reset_flag = false;
        }
        *detection = fixed_lpwwd_post(dPt->pp_component.ifx_component_pt, in_probs);
#ifdef PROFILER
        ifx_cycle_profile_stop(&(dPt->pp_component.profile));
#endif
#else
        return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_ERR_INVALID_COMPONENT_ID); /* Please define ENABLE_IFX_LPWWD_HMMS */
#endif
    }
    else if (component_id == IFX_POST_PROCESS_IP_COMPONENT_LPWWD)
    {
        lpwwd_postprocess_top_struct* dPt;
#ifdef PROFILER
        ifx_cycle_profile_start(&(dPt->pp_component.profile));
#endif
        dPt = (lpwwd_postprocess_top_struct*) postprocess_container;
        if (dPt->pp_component.reset_flag)
        {/* one time reset */
            ifx_lpwwd_post_process_reset(postprocess_container);
            dPt->pp_component.reset_flag = false;
        }
        int32_t status = ifx_lpwwd_post_process(postprocess_container, in_probs, detection);
#ifdef PROFILER
        ifx_cycle_profile_stop(&(dPt->pp_component.profile));
#endif
        if (status != IFX_SP_ENH_SUCCESS)
        {
            return status;
        }
    }
    else
    {
        return IFX_SP_ENH_ERROR(component_id, IFX_SP_ENH_FEATURE_NOT_SUPPORTED);
    }
#endif
    return IFX_SP_ENH_SUCCESS;
}

void removePrefixSpaces(char* str1)
{
    char* str2;
    str2 = str1;
    while (isspace((int)(*str2))) str2++;
    if (str2 != str1) memmove(str1, str2, strlen(str2) + 1);
}
/**
 * \brief : ifx_class_convertion_init() is the API function to process inference classification id_string and initilize output_id_array
 *          before call ifx_class_convertion_for_pp() function.
 *
 * \param[in]  id_string                : Pointer to string decribing the inference classification indetifications which must contain
 *                                        "WWDtoken0" to "WWDtoken3", and "noise". Each ID should only occur once, and its position in the
 *                                        string corresponds to its inference classification position. Please notice that "garbage" is a
 *                                        optional ID since initilization process will treat other than above IDs as garbage. Each ID shall
 *                                        be seperated by ",".
 *                                        Note the inference classification IDs order is decided by the NN model during NN model training.
 *                                        For example, "WWDtoken0,WWDtoken1,WWDtoken2,WWDtoken3,garbage,noise" is a valid id_string for 4 token WW model.
 *                                        The number of classes is 6 with 4 token WW model. For 2 token KW model, the number of class is 4.
 *                                        For 2 token 2 WW model, the number of class is 6, and 2 WW model only support 2 token per WW.
 *                                        The last two are always garbage and noise.
 * \param[in]  size                     : Inference output classification size
 * \param[in]  ww_tokens                : Number of tokens in wake word
 * \param[out] output_id_array          : Pointer to the output buffer containing inference classification indetification number.
 * \return                              : Return 0 when success, otherwise return error code
 *                                        INVALID_ARGUMENT if input or output argument is invalid
 *                                        or error code from specific infineon post process component.
 *                                        Please note error code is 8bit LSB, line number where the error happened in
 *                                        code is in 16bit MSB, and its IP component index if applicable will be at
 *                                        bit 8 to 15 in the combined 32bit return value.
*/
#define PP_CLASS_WWDTOKEN0  (0)     /* Wake word token0 is the first of one keyword NN inference output */
#define PP_CLASS_WWDTOKEN1  (1)     /* Wake word token1 is the second of one keyword NN inference output */
#define PP_CLASS_WWDTOKEN2  (2)     /* Wake word token2 is the third of one keyword NN inference output */
#define PP_CLASS_WWDTOKEN3  (3)     /* Wake word token3 is the fourth of one keyword NN inference output */
int32_t ifx_class_convertion_init(const char* id_string, int* output_id_array, int size, int ww_tokens)
{
    int class_num = ww_tokens + 2; // 2 for noise and garbage
    if (id_string == NULL || output_id_array == NULL || size < class_num)
    {
        return IFX_SP_ENH_ERROR(IFX_POST_PROCESS_IP_COMPONENT_HMMS, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }

    uint16_t num_neg_token = 0, num_noise_token = 0, num_pos_token = 0;
    char output_id_string_cpy[MAX_CLASS_ID_LENGTH]; // for making copy of output_id_string since strtok will modify it
    int garbage_pos = ww_tokens; // garbage position in the output_id_array (right after token ends)
    int noise_pos = ww_tokens+1; // noise position in the output_id_array (right after garbage ends)
    strcpy(output_id_string_cpy, id_string);
    char* token = strtok(output_id_string_cpy, ",");
    int output_count = 0;
    while (token != NULL)
    {// parse through output id string
        if (output_count == size)
        {
            return IFX_SP_ENH_ERROR(IFX_POST_PROCESS_IP_COMPONENT_HMMS, IFX_SP_ENH_ERR_NUMBER_PARMS);
        }
        removePrefixSpaces(token);
        if (strncmp(token, "WWDtoken0", 9) == 0)
        {
            num_pos_token++;
            output_id_array[output_count++] = PP_CLASS_WWDTOKEN0;
        }
        else if (strncmp(token, "WWDtoken1", 9) == 0)
        {
            num_pos_token++;
            output_id_array[output_count++] = PP_CLASS_WWDTOKEN1;
        }
        else if (strncmp(token, "WWDtoken2", 9) == 0)
        {
            num_pos_token++;
            output_id_array[output_count++] = PP_CLASS_WWDTOKEN2;
        }
        else if (strncmp(token, "WWDtoken3", 9) == 0)
        {
            num_pos_token++;
            output_id_array[output_count++] = PP_CLASS_WWDTOKEN3;
        }
        else if (strncmp(token, "noise", 5) == 0)
        {
            num_noise_token++;
            output_id_array[output_count++] = noise_pos; // noise position in the output_id_array
        }
        else
        {// negative IDs will be combined as "garbage".
            num_neg_token++;
            output_id_array[output_count++] = garbage_pos; // garbage position in the output_id_array
        }
        token = strtok(NULL, ",");
    }
    if (output_count < size)
    {
        return IFX_SP_ENH_ERROR(IFX_POST_PROCESS_IP_COMPONENT_HMMS, IFX_SP_ENH_ERR_NUMBER_PARMS);
    }
    if (size - num_neg_token != class_num - 1 || num_noise_token != 1 || num_pos_token < 2 || num_pos_token > 4)
    {
        return IFX_SP_ENH_ERROR(IFX_POST_PROCESS_IP_COMPONENT_HMMS, IFX_SP_ENH_ERR_PARAM_RANGE);
    }
    return IFX_SP_ENH_SUCCESS;
}

/**
 * \brief : ifx_class_convertion_for_pp() is the API function to convert multi-keyword inference output to one keyword post-process
 *          classification before using post process to declare WWD.
 *
 * \param[in]  input_score              : Pointer to two keyword inference output buffer
 * \param[in]  data_type                : Infineon inference output (input_score) data type, and it is also output_score data type.
 * \param[in]  id_array                 : Pointer to the buffer containing inference classification indetification number
 * \param[in]  size                     : Inference output classification size
 * \param[in]  ww_tokens                : Number of tokens in wake word
 * \param[out] output_score             : Corresponding one key word inference output buffer pointer.
 * \return                              : Return 0 when success, otherwise return error code
 *                                        INVALID_ARGUMENT if input or output argument is invalid
 *                                        or error code from specific infineon post process component.
 *                                        Please note error code is 8bit LSB, line number where the error happened in
 *                                        code is in 16bit MSB, and its IP component index if applicable will be at
 *                                        bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_class_convertion_for_pp(void* input_score, int data_type, void* output_score, int* id_array, int size, int ww_tokens)
{
    if (input_score  == NULL || output_score == NULL || id_array == NULL )
    {
        return IFX_SP_ENH_ERROR(IFX_POST_PROCESS_IP_COMPONENT_HMMS, IFX_SP_ENH_ERR_INVALID_ARGUMENT);
    }
    if (data_type != IFX_ML_DATA_FLOAT && data_type != IFX_ML_DATA_INT16 && data_type != IFX_ML_DATA_INT8)
    {
        return IFX_SP_ENH_ERROR(IFX_POST_PROCESS_IP_COMPONENT_HMMS, IFX_SP_ENH_ERR_PARAM);
    }

    int32_t status = IFX_SP_ENH_SUCCESS;
    int garbage_pos = ww_tokens; // garbage position in the output_id_array (right after token ends)
    {
        int total_neg_score_int = 0;
        int8_t *int8_ptr, *out_int8_ptr;
        int16_t* int16_ptr, * out_int16_ptr;
        float total_neg_score_f32 = 0;
        float *f32_ptr, *out_f32_ptr;

        // save total negative score and other scores
        if (data_type == IFX_ML_DATA_FLOAT)
        {
            f32_ptr = (float*)input_score;
            out_f32_ptr = (float*)output_score;
            for (int i = 0; i < size; i++)
            {
                if (id_array[i] == garbage_pos)
                {// add all negative scores
                    total_neg_score_f32 += f32_ptr[i];
                }
                else
                {
                    out_f32_ptr[id_array[i]] = f32_ptr[i];
                }
            }
            out_f32_ptr[garbage_pos] = total_neg_score_f32;
        }
        else if (data_type == IFX_ML_DATA_INT16)
        {
            int16_ptr = (int16_t*)input_score;
            out_int16_ptr = (int16_t*)output_score;
            for (int i = 0; i < size; i++)
            {
                if (id_array[i] == garbage_pos)
                {// add all negative scores
                    total_neg_score_int += int16_ptr[i];
                }
                else
                {
                    out_int16_ptr[id_array[i]] = int16_ptr[i];
                }
            }
            out_int16_ptr[garbage_pos] = total_neg_score_int;
        }
        else
        {
            int8_ptr = (int8_t*)input_score;
            out_int8_ptr = (int8_t*)output_score;
            for (int i = 0; i < size; i++)
            {
                if (id_array[i] == garbage_pos)
                {// add all negative scores
                    total_neg_score_int += int8_ptr[i];
                }
                else
                {
                    out_int8_ptr[id_array[i]] = int8_ptr[i];
                }
            }
            out_int8_ptr[garbage_pos] = total_neg_score_int;
        }
    }
    return status;
}
